## Terraform Plan for Staging Environment

**Environment**: Staging
**Branch**: develop
**Triggered by**: PR #100
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group_rule.alb_ecs_tasks_egress[0] will be destroyed
  # (because aws_security_group_rule.alb_ecs_tasks_egress is not in configuration)
  - resource "aws_security_group_rule" "alb_ecs_tasks_egress" {
      - description              = "Allow outbound traffic to ECS tasks on port 8080" -> null
      - from_port                = 8080 -> null
      - id                       = "sgrule-3033409050" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0fcb79c15a2bb842d" -> null
      - security_group_rule_id   = "sgr-0c4e9261d77b80230" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-06dbc168b612c2995" -> null
      - to_port                  = 8080 -> null
      - type                     = "egress" -> null
    }

  # aws_security_group_rule.database_ecs_tasks_ingress[0] will be destroyed
  # (because aws_security_group_rule.database_ecs_tasks_ingress is not in configuration)
  - resource "aws_security_group_rule" "database_ecs_tasks_ingress" {
      - description              = "Allow ECS tasks to access database on port 3306" -> null
      - from_port                = 3306 -> null
      - id                       = "sgrule-1316140917" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0bd02625af14e4b78" -> null
      - security_group_rule_id   = "sgr-0022c1459f1e93a01" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-06dbc168b612c2995" -> null
      - to_port                  = 3306 -> null
      - type                     = "ingress" -> null
    }

  # module.ecs[0].aws_ecs_service.blue will be updated in-place
  ~ resource "aws_ecs_service" "blue" {
      ~ enable_execute_command             = true -> false
        id                                 = "arn:aws:ecs:us-east-2:123324351829:service/staging-ecs-cluster/staging-blue-service"
        name                               = "staging-blue-service"
        tags                               = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging-blue-service"
            "Project"     = "tf-playground"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-blue-task:10" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs[0].aws_ecs_service.green will be updated in-place
  ~ resource "aws_ecs_service" "green" {
      ~ enable_execute_command             = true -> false
        id                                 = "arn:aws:ecs:us-east-2:123324351829:service/staging-ecs-cluster/staging-green-service"
        name                               = "staging-green-service"
        tags                               = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging-green-service"
            "Project"     = "tf-playground"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-green-task:8" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs[0].aws_ecs_task_definition.blue must be replaced
-/+ resource "aws_ecs_task_definition" "blue" {
      ~ arn                      = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-blue-task:10" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-blue-task" -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "staging-blue-task" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
        tags                     = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging-blue-task"
            "Project"     = "tf-playground"
        }
        # (12 unchanged attributes hidden)
    }

  # module.ecs[0].aws_ecs_task_definition.green must be replaced
-/+ resource "aws_ecs_task_definition" "green" {
      ~ arn                      = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-green-task:8" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-green-task" -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "staging-green-task" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
        tags                     = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging-green-task"
            "Project"     = "tf-playground"
        }
        # (12 unchanged attributes hidden)
    }

  # module.ecs[0].aws_iam_policy.ecs_exec_access will be destroyed
  # (because aws_iam_policy.ecs_exec_access is not in configuration)
  - resource "aws_iam_policy" "ecs_exec_access" {
      - arn              = "arn:aws:iam::123324351829:policy/staging-ecs-exec-access" -> null
      - attachment_count = 1 -> null
      - description      = "Allow ECS tasks to use ECS Exec" -> null
      - id               = "arn:aws:iam::123324351829:policy/staging-ecs-exec-access" -> null
      - name             = "staging-ecs-exec-access" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:CreateControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:OpenDataChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPARZNVUIVKRECLTM3RX" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Environment" = "staging"
          - "ManagedBy"   = "terraform"
          - "Pipeline"    = "gitflow-cicd"
          - "Project"     = "tf-playground"
          - "Tier"        = "staging"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.ecs[0].aws_iam_role_policy_attachment.ecs_task_role_ecs_exec will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_role_ecs_exec is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_task_role_ecs_exec" {
      - id         = "staging-ecs-task-role-20250728182701102800000001" -> null
      - policy_arn = "arn:aws:iam::123324351829:policy/staging-ecs-exec-access" -> null
      - role       = "staging-ecs-task-role" -> null
    }

  # module.networking.aws_security_group.database will be updated in-place
  ~ resource "aws_security_group" "database" {
        id                     = "sg-0bd02625af14e4b78"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow ECS tasks to access database on port 3306"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-06dbc168b612c2995",
                ]
              - self             = false
              - to_port          = 3306
            },
            # (1 unchanged element hidden)
        ]
        name                   = "staging-database-sg"
        tags                   = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging-database-sg"
            "Project"     = "tf-playground"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 6 to destroy.

Changes to Outputs:
  - ecs_tasks_security_group_id      = "sg-06dbc168b612c2995" -> null

  ```
  
  </details>